# Database Test

### Imports

In [75]:
import pandas as pd
import numpy as np
import sqlite3
import plotly.express as px

In [53]:
df_overview = pd.read_csv("data.csv")
entry = 1
filename = df_overview["Output"][entry] + ".csv" 
df = pd.read_csv(filename)

In [54]:
test = df.columns.values.tolist()

test_str = "("
execute_str = "("

for i in test:
    execute_str += "?,"
    if np.issubdtype(int, type(df[i][entry])):
        add_str = i + " integer" + ", "
    elif np.issubdtype(float, type(df[i][entry])):
        add_str = i + " real" + ", "
    elif np.issubdtype(str, type(df[i][entry])):
        add_str = i + " text" + ", "
    else:
        add_str = i + " blob" + ", "
    test_str += add_str

test_str = test_str[:-2] + ")"
execute_str = execute_str[:-1] + ")"
print(test_str)
print(execute_str)

(Rank integer, Name text, D real, E real, T real, H real, Pen. real, Total real, Country text, Qualified text)
(?,?,?,?,?,?,?,?,?,?)

In [43]:
np.issubdtype(type(df["D"][0]), float)

True

### Create Database

In [57]:


# for idx, row in df_overview.iterrows():

connection = sqlite3.connect("test.db")
cursor = connection.cursor()

# cursor.execute("create table test_event " + test_str)
# cursor.executemany("insert into test values " + execute_str, )

# df.to_sql(name="test_table2", con=connection)



# connection.close()

In [74]:
# df_read_from_sql = pd.read_sql('select rank from test_table', connection)
df_read_from_sql = pd.read_sql("SELECT rank from test_table AND test_table2", connection)
df_read_from_sql

DatabaseError: Execution failed on sql 'SELECT rank from test_table AND test_table2': near "AND": syntax error

In [76]:
df_px = px.data.wind()

In [77]:
df_px

    direction strength  frequency
0           N      0-1        0.5
1         NNE      0-1        0.6
2          NE      0-1        0.5
3         ENE      0-1        0.4
4           E      0-1        0.4
..        ...      ...        ...
123       WSW       6+        0.1
124         W       6+        0.9
125       WNW       6+        2.2
126        NW       6+        1.5
127       NNW       6+        0.2

[128 rows x 3 columns]

In [78]:
df_read_from_sql

     Rank
0       1
1       1
2       2
3       2
4       3
..    ...
107    54
108    55
109    55
110    56
111    56

[112 rows x 1 columns]

In [79]:
df_read_from_sql = pd.read_sql("Select rank from (SELECT * from test_table) a", connection)

In [80]:
df_read_from_sql

     Rank
0       1
1       1
2       2
3       2
4       3
..    ...
107    54
108    55
109    55
110    56
111    56

[112 rows x 1 columns]